# GetDeletedElementIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UpdaterData..::..GetDeletedElementIds Method
UpdaterData Class See Also
---
Returns set of elements that were deleted from the document. This set is mutually exclusive of elements returned by getAddedElementIds() and getModifiedElementIds().
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public ICollection<ElementId> GetDeletedElementIds()
```

Visual Basic
---
```text
Public Function GetDeletedElementIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetDeletedElementIds()
```

# ### Return Value
Set of elements that were deleted from the document and triggered the call to execute() Note: This will only return elements if the trigger registered for the associated updater contains the ChangeType returned by Element::getChangeTypeElementDeletion()
# See Also
UpdaterData Class
Autodesk.Revit.DB Namespace